Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/recreational_activities_in_ireland/cultural_institutions/national_library_of_ireland.html.txt.tmx
Source language: en
Languages: ga

source: National Library of Ireland
ga: Leabharlann Náisiúnta na hÉireann

source: The National Library of Ireland, which was established in 1877, houses the country's collection of literary and illustrative works of Irish interest
ga: Is i Leabharlann Náisiúnta na hÉireann, a bunaíodh in 1877, atá bailiúchán na tíre de shaothair liteartha agus léirithe is díol spéise Éireannaí

source: The aim of the Library is to collect, conserve, and present these works, which include collections of printed books, periodicals, manuscripts, prints and drawings, photographs and maps
ga: Is í aidhm na Leabharlainne na saothair seo a bhailiú, a chaomhnú agus a chur i láthair, lena n-áirítear bailiúcháin de leabhair chlóbhuailte, tréimhseacháin, lámhscríbhinní, priontaí agus tarraingtí, grianghraif agus léarscáileanna

source: The Library's collections of books, manuscripts, prints and drawings, maps, photographs, newspapers, music, ephemera and genealogical material comprises the most comprehensive collection of Irish documentary material in the world
ga: Is é an bailiúchán de leabhair chlóbhuailte, lámhscríbhinní, priontaí agus tarraingtí, grianghraif agus léarscáileanna, nuachtáin, ceol, ábhar gearrshaolach agus seanchais an bailiúchán is cuimsithí de cháipéisí Éireannacha ar domhan

source: From its foundation, the Library has endeavored to collect all material of Irish interest or Irish origin published through the ages and throughout the world
ga: Ó bunaíodh í, tá an Leabharlann meáite ar an uile ábhar is díol spéise Éireannaí nó de bhunadh na hÉireann a foilsíodh i rith na n-aoiseanna agus ar fud an domhain a bhailiú

source: It is a legal deposit library of all works published in Ireland
ga: Leabharlann taisce dlithiúla atá inti den uile shaothar a foilsíodh in Éirinn

source: The Genealogical Office, the Office of the Chief Herald in Kildare Street, and the National Photographic Archive in Temple Bar are all part of the National Library
ga: Cuid den Leabharlann Náisiúnta iad an Oifig Ginealais, Oifig Phríomh-Aralt na hÉireann i Sráid Chill Dara, mar aon leis an gCartlann Náisiúnta Ghrianghrafadóireachta i mBarra an Teampaill

source: The Library does not lend books and reading is done in the various reading rooms
ga: Ní thugann an Leabharlann leabhair ar iasacht agus déantar na leabhair a léamh sna seomraí éagsúla léimh

source: It's printed collections include:
ga: I measc a bailiúcháin chlóbhuailte tá:

source: The Manuscripts collection contains a large and varied collection of manuscripts, of which the main components are Gaelic manuscripts, landed estate archives, maps, political material, and literary papers
ga: Tá bailiúchán mór agus éagsúil de lamhscríbhinní sa bhailiúchán lámhscríbhinní agus is lámhscríbhinní na Gaeilge, cartlanna um eastáit talún, léarscáileanna, ábhar polaitiúil, agus páipéir liteartha den fhormhór atá ann

source: The Manuscripts Reading Room is at 2/3 Kildare Street
ga: Tá Seomra Léimh na Lámhscríbhinní lonnaithe ag 2/3 Sráid Chill Dara

source: Its visual collections consist of:
ga: I measc a bhailiúchán amhairc tá:

source: The Library also makes resources digitally available
ga: Ina theannta sin, cuireann an Leabharlann fáil dhigiteach ar acmhainní

source: The Library's Genealogy Service is designed to assist all of those who wish to research their family history in Ireland
ga: Tá Seirbhís Ginealais na Leabharlainne in ainm is cabhrú leo siúd uile ar mian leo taighde a dhéanamh ar stair a dteaghlaigh in Éirinn

source: The Service is freely available to all personal callers to the Library
ga: Tá an tSeirbhís ar fáil go neamhshrianta don uile dhuine a bhuaileann isteach chuig an Leabharlann

source: For first time researchers the Genealogy Service is an ideal starting point, allowing them the opportunity to discuss their research with experienced genealogists and Library staff, ready access to important finding aids and useful information panels
ga: I gcás taighdeoirí céaduaire, pointe iontach tosaithe is í an tSeirbhís Ginealais, áit a ligeann dóibh plé a dhéanamh ar a dtaighde le gineolaithe ag a bhfuil taithí fhairsing agus le foireann na Leabharlainne, mar aon le rochtain gan stró ar áiseanna tábhachtacha cuardaigh agus ar phainéil úsáideacha faisnéise

source: More experienced family historians are also welcome to avail of the Service as, from time to time, they may need assistance with on-going research
ga: Ina theannta sin, cuirtear fáilte roimh staraithe teaghlaigh ag a bhfuil taithí níos fairsinge le leas a bhaint as an tSeirbhís, ó thráth go tráth, de bharr go dtarlódh go dteastódh cúnamh uathu le taighde atá ar bun acu

source: Office of the Chief Herald of Ireland
ga: Oifig Phríomh-Aralt na hÉireann

source: The Chief Herald of Ireland is the State authority on heraldic matters
ga: Is é Príomh-Aralt na hÉireann an t-údarás Stáit a phléann le hábhair araltais

source: The functions of the office are the granting and confirming of coats of arms to individuals and corporate bodies
ga: Is iad feidhmeanna na hoifige deonú agus deimhniú armas do dhaoine agus do chomhlachtaí corparáideacha

source: All arms granted are recorded in the Register of Arms which can be viewed by application through the Manuscripts Reading Room of the National Library
ga: Déantar an uile armas a chur i dtaifead sa Chlár Armas, ar féidir é a fheiceáil ar iarratas trí Sheomra Léimh Lámhscríbhinní na Leabharlainne Náisiúnta

source: A copying service is offered by the Library
ga: Cuireann an Leabharlann seirbhís cóipeála ar fáil

source: There are also a range of self-service copying facilities available to readers
ga: Sa mhullach air sin, tá fáil ar réimse d’áiseanna cóipeála féinfhreastail do léitheoirí

source: The National Library mounts exhibitions of material from its collections
ga: Cuireann an Leabharlann Náisiúnta taispeántais ábhar óna bailiúcháin ar taispeáint

source: It also has a number of travelling exhibitions available for loan
ga: Anuas air sin, tá aici líon taispeántais taistil ar a bhfuil fáil ar iasacht

source: Information on current exhibitions is available on it's website
ga: Tá faisnéis faoi thaispeántais reatha ar fáil ar láithreán gréasáin na Leabharlainne

source: The Library hosts a wide variety of events including public lectures, poetry and music recitals, theatre, children's storytelling and creative workshops
ga: Cuireann an Leabharlann réimse fairsing imeachtaí ar bun, lena n-áirítear léachtanna, ceadail filíochta agus cheoil, amharclannaíochta, seanchas do leanaí agus ceardlanna cruthaitheacha poiblí

source: More information on events is available here
ga: Tá fáil ar thuilleadh faisnéise faoi imeachtaí anseo

source: The National Photographic Archive is located in Meeting House Square in Temple Bar
ga: Tá an Chartlann Náisiúnta Ghriangrafadóireachta lonnaithe i gCearnóg Theach an Tionóil i mBarra an Teampaill

source: It houses a regular programme of exhibitions based on the Library’s photographic collections
ga: Tá sa Chartlann clár rialta de thaispeántais atá bunaithe ar bhailiúcháin ghriangrafadóireachta na Leabharlainne

source: The National Library provides a number of tours of the library each week
ga: Cuireann an Leabharlann Náisiúnta líon tuaras den Leabharlann ar fáil gach seachtain

source: No booking is required
ga: Ní gá rud ar bith a chur in áirithe

source: The Main Reading Room and the Manuscripts Reading Room are open from:
ga: Tá an Príomhsheomra Léimh agus Seomra Léimh na Lámhscríbhinní ar oscailt:

source: • 9.30 am to 7.45 pm, Monday to Wednesday
ga: • Idir 9.30r.n. agus 7.45i.n., ó Luan go Céadaoin

source: • 9.30 am to 12.45 pm on Saturday
ga: agus 4.45i.n., ó Dhéardaoin go hAoine • 9.30r.n

source: Further information on opening hours is available here
ga: Tá tuilleadh faisnéise faoi uaireanta oscailte ar fáil anseo

source: You will need to present a Reader's Ticket to access all collections in the Library, with the exception of the Newspaper Section, which offers a one-day pass
ga: Beidh ort Ticéad Léitheora a thaispeáint le rochtain a fháil ar an uile bhailiúchán sa Leabharlann, seachas an Rannóg Nuachtán, a chuireann pas aon lae ar fáil

source: Admission to the Library and the National Photographic Archive is free
ga: Tá cead isteach chuig an Leabharlann agus chuig an gCartlann Náisiúnta Ghrianghrafadóireachta saor in aisce

source: Admission to the Library's exhibitions is free
ga: Tá cead isteach chuig taispeántais na Leabharlainne saor in aisce

source: Information on the cost of copying services is available here
ga: Tá fáil ar fhaisnéis faoi chostas seirbhísí cóipeála ar fáil anseo

source: You can apply for a Reader's Ticket in the Main Reading Room
ga: Is féidir leat iarratas a chur isteach ar Thicéad Léitheora sa Phríomhsheomra Léimh

source: You will need to bring with you some current photographic identification
ga: Beidh gá duit aitheantas reatha griangraif a thabhairt leat

source: Find out more about Reader's Tickets here
ga: Faigh amach níos mó faisnéise faoi Thicéid Léitheora anseo

source: The National Library can make photocopies, printouts, digital images and prints of items in its Collection
ga: Is féidir leis an Leabharlann Náisiúnta fotachóipeanna, asphriontálacha, íomhánna digiteacha agus priontálacha a dhéanamh d’earraí atá ina Bailiúchán

source: Find out more about ordering copies here
ga: Faigh amach níos mó faisnéise faoi chóipeanna a ordú anseo
